## 4.6 Merging and exporting data

### This script contains the following points:

#### 1. Create data to experiment on
#### 2. Concatenate dataframes
#### 3. Append data
#### 4. Merge data

In [28]:
# Import libraries

import pandas as pd
import numpy as np
import os

#### 1. Create data to experiment on

In [29]:
# Define a dictionary containing January 2020 data 

data1 = {'customer_id':['6732', '767', '890', '635'], 
        'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'], 
        'purchased_meat':[0, 13, 3, 4], 
        'purchased_alcohol':[1, 2, 10, 0],
        'purchased_snacks': [10, 5, 1, 7]}

In [30]:
# Define a dictionary containing February 2020 data 

data2 = {'customer_id':['6732', '767', '890', '635'], 
        'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'], 
        'purchased_meat':[0, 10, 5, 3], 
        'purchased_alcohol':[2, 4, 14, 0],
        'purchased_snacks': [15, 3, 2, 6]}

In [31]:
# Define a dictionary containing March 2020 data 

data3 = {'customer_id':['6732', '767', '890', '635'], 
        'month':['Mar-20', 'Mar-20', 'Mar-20', 'Mar-20'], 
        'purchased_meat':[20, 11, 15, 3], 
        'purchased_alcohol':[12, 14, 14, 0],
        'purchased_snacks': [15, 30, 12, 6]}

In [46]:
# Convert the dictionary into DataFrame  
df_1 = pd.DataFrame(data1,index=[0, 1, 2, 3])
df_2 = pd.DataFrame(data2,index=[0, 1, 2, 3])
df_3 = pd.DataFrame(data3,index=[0, 1, 2, 3])

In [47]:
print (df_1)
print (df_2)
print (df_3)

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6
  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Mar-20              20                 12                15
1         767  Mar-20              11                 14                30
2         890  Mar-20              15                 14                12
3         635  Mar-20               3                  0                 6

#### 2. Concatenate dataframes

In [15]:
# Create a list that contains our dataframes

frames = [df_1, df_2, df_3]

In [16]:
# Check the output

frames

[  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Jan-20               0                  1                10
 1         767  Jan-20              13                  2                 5
 2         890  Jan-20               3                 10                 1
 3         635  Jan-20               4                  0                 7,
   customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Feb-20               0                  2                15
 1         767  Feb-20              10                  4                 3
 2         890  Feb-20               5                 14                 2
 3         635  Feb-20               3                  0                 6,
   customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Mar-20              20                 12                15
 1         767  Mar-20              11                 14                30
 2         890  Mar-20              15                 14                12
 3         635  Mar-20               3                  0                 6]

In [17]:
# Check the data types to be sure it is a list

type(frames)

list

In [18]:
# Concatenate the dataframes using default options

df_concat = pd.concat(frames)

In [19]:
# Check the output

df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6
0        6732  Mar-20              20                 12                15
1         767  Mar-20              11                 14                30
2         890  Mar-20              15                 14                12
3         635  Mar-20               3                  0                 6

In [12]:
# Concatenate the dataframes using the axis = 1 --> create a wide format as an output

df_concat = pd.concat(frames, axis = 1)

In [13]:
# Check the output

df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

#### 3. Append data

In [21]:
df_appended = df_1.append(df_2)

AttributeError: 'DataFrame' object has no attribute 'append'

In [15]:
df_appended

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [22]:
# Create data with different columns from df

data4 = {'customer_id':['6732', '767', '890', '635'], 
        'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'], 
        'days_purchased_on':[0, 13, 3, 4]}

In [23]:
# Convert to dataframe

df_4 = pd.DataFrame(data4,index=[0, 1, 2, 3])

In [24]:
df_4

  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 13
2         890  Jan-20                  3
3         635  Jan-20                  4

In [34]:
# Create a new dataset combining df and df_2

# df_append_test = df_1.append(df_2) ==> Error

#### 4. Merge data

In [44]:
# Merge df and df_2 using customer_id as a key 

df_merged = df_1.merge(df_2, on = ['customer_id'])

In [45]:
df_merged

,customer_id,month_x,purchased_meat_x,purchased_alcohol_x,purchased_snacks_x,month_y,purchased_meat_y,purchased_alcohol_y,purchased_snacks_y
0,6732,Jan-20,0,1,10,Feb-20,0,2,15
1,767,Jan-20,13,2,5,Feb-20,10,4,3
2,890,Jan-20,3,10,1,Feb-20,5,14,2
3,635,Jan-20,4,0,7,Feb-20,3,0,6

In [48]:
# Merge df_1 and df_2 using customer_id and month as a keys 

df_merged = df_1.merge(df_2, on = ['customer_id', 'month'])

In [49]:
df_merged

Empty DataFrame
Columns: [customer_id, month, purchased_meat_x, purchased_alcohol_x, purchased_snacks_x, purchased_meat_y, purchased_alcohol_y, purchased_snacks_y]
Index: []

In [51]:
# Merge df_1 and df_2 using customer_id and month as a keys, add a merge flag

df_merged = df_1.merge(df_2, on = ['customer_id', 'month'], indicator = True)

In [30]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both

In [52]:
df_merged['_merge'].value_counts()

_merge
left_only     0
right_only    0
both          0
Name: count, dtype: int64

In [32]:
# Test merge without overwriting

pd.merge(df,df_2, on = ['customer_id', 'month'], indicator = True)

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both